[
  {
    "source": "Fox News",
    "bias": "right",
    "title": "Senate talks show signs of progress as government shutdown grinds into 2nd month",
    "published": "2025-10-31T13:25:00-04:00",
    "url": "https://www.foxnews.com/politics/senate-talks-show-signs-progress-government-shutdown-grinds-2nd-month",
    "snippets": [
      "There has been a noticeable shift in the Senate over the last week, with lawmakers on either side of the aisle talking more about how to get out of the government shutdown. But it’s not blanket optimism and neither side is ready to announce that an off-ramp to the 31-day shutdown has been finalized. And ultimately, how well the bipartisan talks are going depends on who you ask. Republican and Democrat rank-and-file members, particularly members of the Senate Appropriations Committee, have started talking more as the week has progressed. There are talks of extending the House-passed continuing resolution (CR) to allow time to finish appropriations bills, and Senate Democrats are socializing a package of funding bills among their members. However, the reality is that Senate Democrats again blocked the GOP’s CR for a 13th time, and lawmakers only got one chance to vote on the bill before leaving Washington, D.C., on Thursday. And Senate Democrats are still largely entrenched in their position that expiring Obamacare subsidies must be dealt with before the government reopens, even with the offer of a vote on the matter after the CR is passed. Senate Majority Leader John Thune, R-S.D., was encouraged by Senate Democrats socializing spending bills on their side of the aisle, but he still contended that given the amount of time it takes to process funding bills on the floor, the best option was to reopen the government. \"Unfortunately, doing all that takes a while,\" Thune said. \"Even if you got consent, it still, it’d take a while to move those bills across the floor. So we've got to reopen the government.\" Sen. John Hoeven, R-N.D., said that his Democratic counterparts were beginning to realize that time was running out to actually fund the government through the appropriations process, which is a generally bipartisan affair in the upper chamber given the 60-vote filibuster threshold. When asked if he felt closer to an end to the shutdown now than a month ago, he said, \"Yes.\""
    ]
  },
  {
    "source": "Fox News",
    "bias": "right",
    "title": "Johnson warns against Trump's demand for Senate to go 'nuclear' to end shutdown",
    "published": "2025-10-31T11:37:00-04:00",
    "url": "https://www.foxnews.com/politics/johnson-warns-against-trumps-demand-senate-go-nuclear-end-shutdown",
    "snippets": [
      "House Speaker Mike Johnson, R-La., warned against President Donald Trump's demand for the Senate to invoke the \"nuclear option\" to end the government shutdown.Johnson was asked during his Friday press conference about a late-night Truth Social post in which Trump demanded the Senate get rid of the filibuster and its 60-vote threshold to ram through the GOP's federal funding bill by a simple majority.\"Look, I'll just say this in general, as I've said many times about the filibuster, it's not my call. I don't have a say in this. It's a Senate chamber issue,\" Johnson said. \"But the filibuster has traditionally been viewed as a very important safeguard. If the shoe was on the other foot, I don't think our team would like it. \"Sixty votes are required in the Senate to overcome a filibuster and proceed with debate and a final vote on most pieces of legislation. Senate Democrats attempted to get rid of it when they last held the majority in order to pass reforms that they accused Republicans of blocking, but they were blocked by more moderate members of their own party.If Republicans successfully got rid of it now with a move colloquially known as the \"nuclear option,\" Johnson warned Democrats would then use that standard in the future to pass progressive policies while sidelining the GOP.\"The Democrats, look, they've said what they would do. They would pack the Supreme Court. They would make Puerto Rico and D.C. states. They would ban firearms. They would do all sorts of things that would be very harmful for the country, and the safeguard in the Senate has always been the filibuster,\" Johnson said. \"But again, not my issue, not something I get to even weigh in on.\"The shutdown is in its 31st day after Senate Democrats blocked the GOP from advancing its short-term federal funding bill 13 times since Sept. 19.At the current tallies, five more Senate Democrats are needed to vote with Republicans to overcome the filibuster."
    ]
  },
  {
    "source": "Fox News",
    "bias": "right",
    "title": "Federal judge blocks Trump order requiring citizenship proof on federal voter registration forms",
    "published": "2025-10-31T20:58:00-04:00",
    "url": "https://www.foxnews.com/politics/federal-judge-blocks-trump-order-requiring-citizenship-proof-federal-voter-registration-forms",
    "snippets": [
      "A federal judge has ruled the Trump administration cannot enforce an executive order requiring documented proof of U.S. citizenship on federal voter registration forms, a decision the administration defends as a lawful effort to protect election integrity.U.S. District Judge Colleen Kollar-Kotelly in Washington, D.C., on Friday found the requirement unconstitutional, writing that the president \"lacks the authority to direct such changes.\"\"The first question presented in these consolidated cases is whether the president, acting unilaterally, may direct changes to federal election procedures,\" Kollar-Kotelly wrote in her opinion. \"Because our Constitution assigns responsibility for election regulation to the States and to Congress, this Court holds that the President lacks the authority to direct such changes.\"However, a spokesperson for the White House told Fox News Digital Trump acted within his legal powers.\"President Trump has exercised his lawful authority to ensure only American citizens are casting ballots in American elections,\" White House deputy press secretary Abigail Jackson told Fox News Digital in an email. \"This is so commonsense that only the Democrat Party would file a lawsuit against it.\"We expect to be vindicated by a higher court.\"The judge sided with the plaintiffs — including the League of United Latin American Citizens (LULAC), the Democratic National Committee and the League of Women Voters Education Fund — arguing the Constitution \"assigns no direct role to the president in either domain.\"The ruling says the U.S. Election Assistance Commission is permanently blocked from adding the requirement to the federal voter form, according to The Associated Press.The lawsuit will continue as the judge examines other parts of Trump’s order, according to The Associated Press.In March, President Trump signed an executive order mandating that anyone registering to vote provide government-issued proof of U.S. citizenship.The order also directed the attorney general to enter into information-sharing agreements with state election officials to identify cases of election fraud or other election law violations and conditioned federal election-related funds on states complying with federal election integrity measures."
    ]
  },
  {
    "source": "Associated Press",
    "bias": "center",
    "title": "What’s the filibuster and why does Trump want to get rid of it during the shutdown?",
    "published": "2025-10-31",
    "url": "https://apnews.com/article/trump-filibuster-shutdown-congress-2b46e610460d1c2448c3c7c816454de6",
    "snippets": [
      "WASHINGTON (AP) — Seemingly frustrated by the government shutdown and Democrats’ unwillingness to accept a Republican funding bill, President Donald Trump is once again demanding that the Senate eliminate the legislative filibuster.The filibuster is a longstanding parliamentary tool that halts action on most bills unless 60 senators in the 100-member chamber vote to move forward. Over the years, it has stymied policy priorities for Democrats and Republicans alike, and Trump has been complaining about the maneuver since his first White House term.Getting rid of it would be a way for Republicans to immediately end the now month-long shutdown, he said. “It is now time for the Republicans to play their ‘TRUMP CARD,’ and go for what is called the Nuclear Option — Get rid of the Filibuster, and get rid of it, NOW!” the president wrote on his social media site Thursday night.But majority Republicans have strongly resisted calls to eliminate the legislative filibuster, since it would dilute their power if and when they are in the minority again. In its best form, the filibuster encourages compromise and dealmaking.Here are some common questions about the filibuster, and why it’s coming up now in the shutdown debate.What is a filibuster?Unlike the House, the Senate places few constraints on lawmakers’ right to speak. But senators can use the chamber’s rules to hinder or block votes. That’s what’s effectively a filibuster — a term that, according to Senate records, began appearing in the mid-19th century.The filibuster isn’t in the Constitution and it wasn’t part of the Founding Fathers’ vision for the Senate. It was created inadvertently after Vice President Aaron Burr complained in 1805 that the chamber’s rule book was redundant and overly complicated, according to historians.But how the filibuster is used today doesn’t resemble the public’s longstanding perception of the tactic, which was made famous by the 1939 film, “Mr. Smith Goes to Washington,” in which James Stewart played a senator who spoke on the floor until exhaustion."
    ]
  },
  {
    "source": "Associated Press",
    "bias": "center",
    "title": "The Latest: Trump administration must fund SNAP payments during the shutdown, judges rule",
    "published": "2025-10-31",
    "url": "https://apnews.com/article/trump-filibuster-shutdown-ice-chicago-ebc7bbdf520d9fa6843d27dd7cb84d87",
    "snippets": [
      "Two federal judges ruled nearly simultaneously on Friday that President Donald Trump’s administration must continue to fund SNAP, the nation’s biggest food aid program, using contingency funds during the government shutdown.The rulings came a day before the U.S. Department of Agriculture planned to freeze payments to the Supplemental Nutrition Assistance Program because it said it could no longer keep funding it due to the shutdown.The program serves about 1 in 8 Americans and is a major piece of the nation’s social safety net. Word in October that it would be a Nov. 1 casualty of the shutdown sent states, food banks and SNAP recipients scrambling to figure out how to secure food. Some states said they would spend their own funds to keep versions of the program going.It wasn’t immediately clear how quickly the debit cards that beneficiaries use to buy groceries could be reloaded after the ruling. That process often takes one to two weeks.Here’s the latest:New York Attorney General Letitia James seeks to block Trump administration’s subpoenasThe challenge comes as James pushes back against the administration’s investigation of cases she brought against the president and the National Rifle Association, according to court documents unsealed Friday.James filed a motion in August to block subpoenas issued by acting U.S. Attorney John Sarcone for records related to the legal actions, claiming the Justice Department’s probe of the cases was retaliatory.She also argued that Sarcone was improperly appointed and therefore lacked legitimate authority to authorize the subpoenas.Dozens of court documents in the case have been filed under seal since August. Late Friday a federal judge in Manhattan granted James’ motion to unseal most of them, over the objection of the Justice Department.Judge Lorna Schofield, however, has not yet ruled on the motion to quash the subpoenas.An email seeking comment was sent to Sarcone’s office. A phone message was not immediately returned late Friday.SNAP has provided grocery help for 60-plus years. Here’s how it worksThe Supplemental Nutrition Assistance Program is a major piece of the social safety net used by nearly 42 million, or about 1 in 8 Americans, to help buy groceries.Originally known as the food stamp program, it has existed since 1964, serving low-income people, many of whom have jobs but don’t make enough to cover all basic costs.There are income limits based on family size, expenses and whether households include someone who is elderly or has a disability.Most participants are families with children, and more than 1 in 3 include older adults or someone with a disability.Nearly 2 in 5 recipients are households where someone is employed.Most participants have incomes below the poverty line, about $32,000 for a family of four, according to the Center on Budget and Policy Priorities.The Agriculture Department, which administers SNAP, says nearly 16 million children received benefits in 2023.▶ Read more about how SNAP works"
    ]
  },
  {
    "source": "Associated Press",
    "bias": "center",
    "title": "Judges order Trump administration to use emergency reserves for SNAP payments during the shutdown",
    "published": "2025-10-31",
    "url": "https://apnews.com/article/snap-shutdown-lawsuits-deadline-4af8b0dec6cd31cddd023cc99c131b73",
    "snippets": [
      "Judges order the administration to use",
      "emergency reserves for SNAP payments",
      "during the shutdown"
    ]
  },
  {
    "source": "Washington Post",
    "bias": "left",
    "title": "Trump calls on Republicans to end filibuster with 'nuclear option'",
    "published": "2025-10-31",
    "url": "https://www.washingtonpost.com/politics/2025/10/31/trump-end-filibuster-shutdown-nuclear-option/",
    "snippets": [
      "Trump calls to end the filibuster",
      "use the 'nuclear option'",
      "bypass Democratic opposition"
    ]
  },
  {
    "source": "Washington Post",
    "bias": "left",
    "title": "Republican leaders reject Trump's demands to scrap the filibuster",
    "published": "2025-10-31",
    "url": "https://www.washingtonpost.com/politics/2025/10/31/filibuster-government-shutdown-trump/0308dac0-b660-11f0-88c1-4e2f98984a34_story.html",
    "snippets": [
      "Republican leaders swiftly rejected",
      "scrapping the filibuster",
      "long opposed such a move"
    ]
  },
  {
    "source": "Reuters",
    "bias": "center",
    "title": "Republicans shrug off Trump's call to scrap Senate filibuster over shutdown",
    "published": "2025-10-31",
    "url": "https://www.reuters.com/world/us/republicans-shrug-off-trumps-call-scrap-senate-filibuster-over-shutdown-2025-10-31/",
    "snippets": [
      "Republicans shrug off Trump's call",
      "to scrap the Senate filibuster",
      "shutdown continues"
    ]
  },
  {
    "source": "Reuters",
    "bias": "center",
    "title": "US judge permanently blocks Trump order requiring voters to prove citizenship",
    "published": "2025-10-31",
    "url": "https://www.reuters.com/world/us-judge-permanently-blocks-trump-order-requiring-voters-prove-citizenship-2025-10-31/",
    "snippets": [
      "judge permanently blocks Trump order",
      "proof of citizenship for voters",
      "order issued in March"
    ]
  },
  {
    "source": "Reuters",
    "bias": "center",
    "title": "Trump administration cannot suspend food aid benefits, US judges rule",
    "published": "2025-10-31",
    "url": "https://www.reuters.com/legal/government/us-judge-blocks-trump-administration-suspending-food-aid-benefits-2025-10-31/",
    "snippets": [
      "cannot suspend food aid benefits",
      "judges ordered compliance by Monday",
      "seeking legal clarification on SNAP funding"
    ]
  },
  {
    "source": "Reuters",
    "bias": "center",
    "title": "Trump declines to rule out underground nuclear tests",
    "published": "2025-10-31",
    "url": "https://www.reuters.com/world/trump-hints-resumption-underground-nuclear-tests-2025-10-31/",
    "snippets": [
      "declines to say whether",
      "underground nuclear tests would resume",
      "Cold War–era practice"
    ]
  },
  {
    "source": "Axios",
    "bias": "center",
    "title": "Trump tells Senate Republicans to use the 'nuclear option' to end shutdown",
    "published": "2025-10-31",
    "url": "https://www.axios.com/2025/10/31/trump-filibuster-government-shutdown-senate",
    "snippets": [
      "initiate the 'nuclear option'",
      "end the Senate filibuster",
      "post on Truth Social"
    ]
  },
  {
    "source": "Axios",
    "bias": "center",
    "title": "U.S. judge blocks Trump order requiring proof of citizenship for voter registration",
    "published": "2025-10-31",
    "url": "https://www.axios.com/2025/10/31/trump-immigration-citizenship-federal-judge",
    "snippets": [
      "judge blocked the executive order",
      "requiring proof of citizenship",
      "federal voter registration forms"
    ]
  },
  {
    "source": "Axios",
    "bias": "center",
    "title": "UN human rights chief condemns boat strikes, urges investigation",
    "published": "2025-10-31",
    "url": "https://www.axios.com/2025/10/31/un-condemns-us-boat-strikes-trump",
    "snippets": [
      "condemned the military strikes on boats",
      "calling for an investigation",
      "in the Caribbean Sea"
    ]
  }
]